Repository: MarioFinale/PeriodiBOT
Catalog: Messages.*.resx
Languages: es

# AddedExtract
source: {0} new extract has been added.
es: Se añadió {0} extracto nuevo.

# AddedExtracts
source: {0} new extracts have been added.
es: Se añadieron {0} extractos nuevos.

# CheckingUser
source: Checking user {0}
es: Comprobando el usuario {0}

source: Checking users.
es: Comprobando usuarios.

# ConfigError
source: Malformed config file.
es: Archivo de configuraciones corrupto

# DoneXPagesReturned
source: Done, {0} pages returned.
es: Hecho, retornando {0} páginas.

# GetLastrevIDs
source: Getting the last revid of {0} pages.
es: Obteniendo el ultimo revid de {0} páginas.

# GetPageExtract
source: Loading page extract of '{0}'.
es: Cargando el extracto de la página '{0}'.

# GetPagesExtract
source: Loading {0} pages extract.
es: Cargando {0} extractos de páginas.

# InvalidUrl
source: The url is invalid.
es: La url ingresada es inválida

# InvalidUser
source: The user '{0}' is invalid.
es: El usuario '{0}' es inválido.

source: Loading config
es: Cargando configuraciones

# LoadingNewExtracts
source: Loading {0} new extracts
es: Cargando {0} resúmenes nuevos.

# LoadingOldExtracts
source: Loading {0} old extracts
es: Cargando {0} resúmenes antiguos.

# LoginError
source: Login failed
es: Falló el inicio de sesión

source: Login ID:
es: ID de usuario:

source: Login result:
es: Resultado:

source: Network error:
es: Error de conexión:

# NewBotName
source: Bot name:
es: Nombre del bot:

# NewBotPassword
source: Wiki BOT password:
es: Contraseña de BOT en la Wiki:

# NewConfigFileError
source: Error creating a new config file
es: Error al crear un nuevo archivo de configuraciones

# NewConfigMessage
source: There is no config file, please fill the following data or close the program and manually create a new config file.
es: El archivo de configuraciones no existe, por favor completa los siguientes campos o cierra el programa y crea el archivo manualmente.

# NewIrcNetworkAdress
source: IRC server main adress:
es: Dirección del servidor de IRC principal:

# NewIrcNetworkChannels
source: IRC channels (separated by pipes [|]):
es: Canales de IRC (separados por pipe [|]):

# NewIrcNetworkNickName
source: IRC Nickname:
es: Nickname en el servidor IRC:

# NewIrcNetworkPass
source: IRC Nickserv/Server password:
es: Contraseña de Nickserv o de servidor:

# NewWikiMainApiUrl
source: Wiki API Url:
es: URL de la API de la Wiki:

# NewWikiMainUrl
source: Wiki Url:
es: URL principal de la Wiki:

# NextNotif
source: . The next notice will be in 5 minutes.
es: . El próximo aviso será en 5 minutos.

source: No config file
es: El archivo de configuraciones no existe

# OmittedExtract
source: {0} unsafe extract has been omitted.
es: Se omitió {0} extracto inseguro.

# OmittedExtracts
source: {0} unsafe extracts have been omitted.
es: Se omitieron {0} extractos inseguros.

# OresQueryError
source: Server error on ORES query score from revid {0} (invalid diff?)
es: Error de servidor en la query del puntaje ORES desde el revid {0} (diff inválido?)

# OresQueryEx
source: ORES query from revid {0} EX: {1}
es: Excepción al obtener el puntaje ORES del revid {0}. EX: {1}

# OresQueryResult
source: ORES query for revid {0} done. GF: {1} DMG: {2}
es: Query del puntaje ORES del revid {0} completada. GF: {1} DMG: {2}

# PageLoaded
source: Page '{0}' loaded.
es: Página '{0}' cargada.

# PressKey
source: Press any key to exit
es: Presione cualquier tecla para salir

source: Reason:
es: Motivo:

source: Recreating text.
es: Recreando texto.

source: Requesting token
es: Obteniendo token

# SaveConfigError
source: Error saving the config.
es: Error al guardar las configuraciones.

# SigninIn
source: Signing in
es: Iniciando sesión

source: Successful operation.
es: Operación exitosa.

# TextReplaced
source: (Bot) Replacing '{0}' with '{1}' {2}.
es: (Bot) Reemplazando '{0}' con '{1}' {2}.

source: Token obtained
es: Token obtenido

# TryingToSave
source: Trying to save '{0}'.
es: Intentando guardar '{0}'.

# UnsignedSumm
source: (Bot) Adding {0}'s missing signature.
es: (Bot) Añadiendo firma faltante de '{0}'.

source: Unsuccessful operation.
es: La operación ha fallado.

# UpdatedExtracts
source: (Bot) Updated {0} resumes.
es: (Bot) {0} resúmenes actualizados.

# UserBlocked
source: User {0} is blocked.
es: El usuario {0} está bloqueado.

# UserEditedDay
source: The last edit of {0} was {1} day ago.
es: La última edición de {0} fue hace {1} día.

# UserEditedDays
source: The last edit of {0} was {1} days ago.
es: La última edición de {0} fue hace {1} días.

# UserEditedHour
source: The last edit of {0} was {1} hour ago.
es: La última edición de {0} fue hace {1} hora.

# UserEditedHours
source: The last edit of {0} was {1} hours ago.
es: La última edición de {0} fue hace {1} horas.

# UserEditedMinutes
source: The last edit of {0} was {1} minutes ago.
es: La última edición de {0} fue hace {1} minutos.

# UserInactive
source: User {0} is inactive.
es: El usuario {0} está inactivo.

# UserInexistent
source: User {0} does not exist.
es: El usuario {0} no existe.

# UserJustEdited
source: {0} has just edited.
es: {0} acaba de editar.

# UserNoEdits
source: The user {0} have not edited on this Wiki.
es: El usuario {0} no tiene ediciones en esta Wiki.

# AutoArchive
source: Autoarchiving '{0}'.
es: Autoarchivando '{0}'.

# NullParameter
source: The parameter is null.
es: El parámetro es nulo.

# WikiThreadError
source: Thread error on page '{0}'. Thread number: {1}. EX: {2}
es: Error en un hilo de la página '{0}'. Hilo número {1}. EX: {2}
